# =============================================================================
# Brewfile - AI Engineer Essentials
# =============================================================================

# CLI Tools
brew "git"
brew "gh"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"

# Python
brew "python@3.12"
brew "uv"
brew "pipx"

# Node.js (for MCP servers)
brew "node"
brew "pnpm"

# AI/Data
brew "poppler"

# Apps
cask "cursor"
cask "iterm2"
cask "raycast"
cask "docker"
cask "google-chrome"
