# =============================================================================
# Brewfile - AI Engineer Essentials
# =============================================================================

# CLI Tools
brew "git"
brew "gh"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"

# Python
brew "python@3.12"
brew "uv"
brew "pipx"

# Node.js (for MCP servers)
brew "node"
brew "pnpm"

# AI/Data
brew "poppler"

# Apps
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "codex-app"
cask "comet"
cask "cursor"
cask "iterm2"
cask "raycast"
cask "docker"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "logi-options+"

# Screen Recording
brew "lihaoyun6/tap/quickrecorder"
